# SlabShapeEditor Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeEditor Class
Members See Also
---
An object used for Slab Shape Editing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class SlabShapeEditor : IDisposable
```

Visual Basic
---
```text
Public Class SlabShapeEditor _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SlabShapeEditor : IDisposable
```

# Remarks
The SlabShapeEditor can be obtained from a slab object, such as a roof or floor.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SlabShapeEditor
# See Also
SlabShapeEditor Members
Autodesk.Revit.DB Namespace